"""
    配置了 SimNow 常用的四个环境
    可以使用监控平台 http://openctp.cn 查看前置服务是否正常
"""

# 也可以按需配置其他的支持 ctp官方ctpapi库的柜台
# 注意需要同时修改相应的 user/password/broker_id/authcode/appid 等信息

# SimNow 提供的四个环境
fronts = {
    "7x24": {
        "td": "tcp://180.168.146.187:10130",
        "md": "tcp://180.168.146.187:10131",
    },
    "电信1": {
        "td": "tcp://180.168.146.187:10201",
        "md": "tcp://180.168.146.187:10211",
    },
    "电信2": {
        "td": "tcp://180.168.146.187:10202",
        "md": "tcp://180.168.146.187:10212",
    },
    "移动": {
        "td": "tcp://218.202.237.33:10203",
        "md": "tcp://218.202.237.33:10213",
    },
    "tts": {
        "td": "tcp://121.37.80.177:20002",
        "md": "tcp://121.37.80.177:20004",
    },
    "gt": {
        "td": "tcp://180.169.50.131:42205",
        "md": "tcp://101.226.254.58:41213",
    },
    "gt2": {
        "td": "tcp://101.230.113.157:21205",
        "md": "tcp://101.230.113.157:21213",
    },
    "emt": {
        "td": "tcp://61.152.230.41:19088",
        "md": "tcp://61.152.230.216:8093",
    },
    "hx": {
        "td": "tcp://210.14.72.16:9500",
        "md": "tcp://210.14.72.16:9402",
    },
}

# 投资者ID / 密码
# user = "226485"
# password = "sWJedore20@$0807"
# user = "058762"
# password = "Jt14235678"
# user = "4645"
# password = "557557"
# user = "510100005510"
# password = "ie9560"
user = "00030736"
password = "61449185"

# 以下为连接 SimNow 环境的固定值
broker_id = ""
authcode = ""
appid = "1"
