#--------------------------------------------------------------------------------
# 참조 모듈 목록.
#--------------------------------------------------------------------------------
from __future__ import annotations
from typing import Awaitable, Callable, Final, Iterator, Optional, Sequence, Type, TypeVar, Union, Tuple, Any, List, Dict, Set, cast, overload
from .builtins import Builtins


#--------------------------------------------------------------------------------
# 전역 상수 목록.
#--------------------------------------------------------------------------------


#--------------------------------------------------------------------------------
# 기본 메타 클래스. (타입 클래스)
# - 명시적인 형태로 사용하기 위해 클래스화.
#--------------------------------------------------------------------------------
class BaseMetaClass(type):
	pass